[
    {
        "CA1.1": "Recoñecer e valorar, a partir da explicación da orixe común do galego e do portugués e do seu desenvolvemento histórico e sociolingüístico, as semellanzas e diferenzas entre as dúas linguas, identificando e contrastando os trazos lingüísticos máis salientables e ampliando o repertorio léxico en lingua portuguesa."
    },
    {
        "CA1.2": "Recoñecer e valorar as variantes dialectais do galego, identificando os trazos fónicos, gramaticais e léxicos máis característicos dos bloques e das principais áreas lingüísticas, establecendo as diferenzas respecto da norma e distinguindo estes trazos dos sociolectais e de rexistro en manifestacións orais, escritas e multimodais."
    },
    {
        "CA1.3": "Identificar e cuestionar prexuízos e estereotipos lingüísticos adoptando unha actitude de respecto e valoración da riqueza cultural, lingüística e dialectal a partir da análise da diversidade lingüística da contorna escolar e social próxima e da exploración e reflexión sociolingüística sobre os fenómenos de contacto entre linguas e da indagación dos dereitos lingüísticos individuais e colectivos."
    },
    {
        "CA1.4": "Valorar a lingua éuscara, analizando as súas características máis salientables para coñecer e comprender a realidade lingüística de España."
    },
    {
        "CA1.5": "Elaborar traballos de investigación de maneira progresivamente autónoma en diferentes soportes sobre diversos temas de interese académico, persoal ou social, partindo da información seleccionada."
    },
    {
        "CA2.1": "Comprender e valorar o sentido global, a estrutura, a información máis relevante en función das necesidades comunicativas e a intención do emisor en textos orais, escritos e multimodais de certa complexidade de diferentes ámbitos, analizando a interacción entre os diferentes códigos e avaliando a súa calidade, a súa fiabilidade e a idoneidade da canle utilizada, así como a eficacia dos procedementos comunicativos empregados."
    },
    {
        "CA2.2": "Realizar exposicións e argumentacións orais e escritas de certa extensión e complexidade con diferente grao de planificación sobre temas de interese persoal, social, educativo e profesional axustándose ás convencións propias dos diversos xéneros discursivos, con fluidez, coherencia e cohesión e co rexistro adecuado en diferentes soportes, utilizando de maneira eficaz recursos verbais e non verbais."
    },
    {
        "CA2.3": "Participar de maneira activa e axeitada en interaccións orais informais e en situacións orais formais de carácter dialogado, mantendo actitudes de escoita activa e estratexias de cooperación conversacional e de cortesía lingüística."
    },
    {
        "CA2.4": "Comprender, valorar e interpretar o sentido global, a estrutura, a información máis relevante e a intención do emisor de textos escritos e multimodais de certa complexidade, realizando as inferencias necesarias e avaliando a súa calidade e fiabilidade, así como a eficacia dos procedementos lingüísticos empregados."
    },
    {
        "CA2.5": "Planificar a redacción de textos escritos e multimodais sinxelos, atendendo á situación comunicativa, ao destinatario, ao propósito e á canle, presentando, despois da súa revisión, un texto final coherente, cohesionado e co rexistro adecuado."
    },
    {
        "CA2.6": "Localizar, seleccionar e contrastar información de maneira progresivamente autónoma procedente de diferentes fontes, calibrando a súa fiabilidade e reelaborala e comunicala de maneira creativa adoptando un punto de vista crítico e respectando os principios de propiedade intelectual."
    },
    {
        "CA2.7": "Adoptar hábitos de uso crítico, seguro, sustentable e saudable das tecnoloxías dixitais con relación á procura e á comunicación da información, reflexionando sobre as posibles manipulacións presentes nas canles de transmisión da información."
    },
    {
        "CA2.8": "Revisar os textos propios de maneira progresivamente autónoma e identificar e solucionar os problemas de comprensión lectora utilizando os coñecementos explícitos sobre a lingua e o seu uso."
    },
    {
        "CA2.9": "Identificar e desterrar os usos discriminatorios da lingua, os abusos a través da palabra e os usos manipuladores da linguaxe partindo da reflexión e da análise dos elementos lingüísticos, textuais e discursivos utilizados, así como dos elementos non verbais da comunicación."
    },
    {
        "CA2.10": "Utilizar estratexias para a resolución dialogada dos conflitos, procurando consensos, tanto no ámbito persoal como no educativo e no social."
    },
    {
        "CA3.1": "Comprender e interpretar o sentido global, a estrutura, a información máis relevante e a intención do emisor de textos escritos e multimodais de certa complexidade, realizando as inferencias necesarias e con diferentes propósitos de lectura."
    },
    {
        "CA3.2": "Valorar criticamente o contido e a forma de textos de certa complexidade avaliando a súa calidade e fiabilidade, así como a eficacia dos procedementos lingüísticos empregados."
    },
    {
        "CA3.3": "Ler de maneira autónoma textos seleccionados en función dos propios gustos, intereses e necesidades e deixar constancia do progreso do propio itinerario lector e cultural explicando os criterios de selección das lecturas, as formas de acceso á cultura literaria e a experiencia da lectura."
    },
    {
        "CA3.4": "Compartir a experiencia da lectura en soportes diversos relacionando o sentido da obra coa propia experiencia biográfica, lectora e cultural."
    },
    {
        "CA3.5": "Explicar e argumentar a interpretación das obras lidas a partir da análise das relacións internas dos seus elementos constitutivos co sentido da obra, e das relacións externas do texto co seu contexto sociohistórico, atendendo á configuración e á evolución dos xéneros e subxéneros literarios."
    },
    {
        "CA3.6": "Establecer de maneira progresivamente autónoma vínculos argumentados entre os textos lidos e outros textos escritos, orais ou multimodais, así como con outras manifestacións artísticas e culturais, en función de temas, tópicos, estruturas, linguaxe e valores éticos e estéticos, mostrando a implicación e a resposta persoal do lector na lectura."
    },
    {
        "CA3.7": "Crear textos persoais ou colectivos con intención literaria e conciencia de estilo, en distintos soportes e coa axuda doutras linguaxes artísticas e audiovisuais, a partir da lectura de obras ou fragmentos significativos en que se empreguen as convencións formais dos diversos xéneros e estilos literarios."
    },
    {
        "CA4.1": "Incorporar procedementos para enriquecer os textos atendendo a aspectos discursivos, lingüísticos e de estilo, con precisión léxica e corrección ortográfica e gramatical, valorando o dominio do sistema fonético-fonolóxico, o uso do léxico tradicional e as construcións morfosintácticas máis xenuínas."
    },
    {
        "CA4.2": "Revisar os textos propios de maneira progresivamente autónoma e identificar e solucionar os problemas de comprensión lectora utilizando os coñecementos explícitos sobre a lingua e o seu uso."
    },
    {
        "CA4.3": "Explicar e argumentar a interrelación entre o propósito comunicativo e as eleccións lingüísticas do emisor, así como os seus efectos no receptor, utilizando o coñecemento explícito da lingua e a metalinguaxe específica."
    },
    {
        "CA4.4": "Formular xeneralizacións sobre algúns aspectos do funcionamento da lingua a partir da observación, a comparación e a transformación de enunciados, así como da formulación de hipóteses e a procura de contraexemplos, utilizando a metalinguaxe específica e consultando de maneira progresivamente autónoma dicionarios, manuais e gramáticas."
    }
]
